app/controllers/homes_controller.rb

  def welcome
    @posts = Post.where(shared: true)
---
SELECT "posts".* FROM "posts" WHERE "posts"."shared" = $1  [["shared", true]]