app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "fff"], ["description", "fffd"], ["image", "3.jpeg"], ["user_id", 3], ["created_at", "2021-09-20 05:24:11.925928"], ["updated_at", "2021-09-20 05:24:11.925928"]]
---
  def create
  @post = current_user.posts.new(post_params)
  respond_to do |format|
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "posts" SET "shared" = $1 WHERE "posts"."id" = $2  [["shared", true], ["id", 20]]
---
  def share
    post = Post.find_by_id(params[:post_id])
    respond_to do |format|
      if post.update_column('shared', true)

SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_post
    @post = Post.find_by_id(params[:id])