app/models/post.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "good1"], ["created_at", "2021-09-22 09:13:07.741253"], ["updated_at", "2021-09-22 09:13:07.741253"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["name", "good1"], ["LIMIT", 1]]
---
  def all_tags=(names)
    self.tags = names.split(",").map do |name|
        Tag.where(name: name.strip).first_or_create!

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = $1  [["post_id", 18]]
---
  def all_tags
    self.tags.map(&:name).join(", ")

SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "good1"], ["LIMIT", 1]]
---
  def self.tagged_with(name)
  Tag.find_by_name!(name).posts